import { foods } from './types';

export const rikishiIdeal: foods = {
  カロリー: 2832,
  タンパク質: 91,
  脂質: 240,
  炭水化物: 63,
  糖質: 46.8,
  食物繊維: 25.2,

  // ミネラル
  ナトリウム: 6888,
  食塩相当量: 18,
  カリウム: 2844,
  カルシウム: 1380,
  マグネシウム: 228,
  リン: 1608,
  鉄: 13,
  亜鉛: 13,
  銅: 0.84,
  マンガン: 1.32,
  ヨウ素: 96,
  セレン: 156,
  クロム: 12,
  モリブデン: 60,

  // ビタミン
  ビタミンA: 1200,
  betaカロテン: 6468,
  ビタミンD: 8,
  ビタミンE: 32,
  ビタミンK: 864,
  ビタミンB1: 1.2,
  ビタミンB2: 2,
  ナイアシン: 32,
  ビタミンB6: 1.2,
  ビタミンB12: 9,
  葉酸: 912,
  パントテン酸: 6,
  ビオチン: 111,
  ビタミンC: 84,
};
