import { food, wannaEat, ideal, foodDetail } from './types';

export const rikishiIdeal: food = {
  カロリー: 2832,
  タンパク質: 91,
  脂質: 240,
  炭水化物: 63,
  糖質: 46.8,
  食物繊維: 25.2,

  // ミネラル
  ナトリウム: 6888,
  食塩相当量: 18,
  カリウム: 2844,
  カルシウム: 1380,
  マグネシウム: 228,
  リン: 1608,
  鉄: 13,
  亜鉛: 13,
  銅: 0.84,
  マンガン: 1.32,
  ヨウ素: 96,
  セレン: 156,
  クロム: 12,
  モリブデン: 60,

  // ビタミン
  ビタミンA: 1200,
  betaカロテン: 6468,
  ビタミンD: 8,
  ビタミンE: 32,
  ビタミンK: 864,
  ビタミンB1: 1.2,
  ビタミンB2: 2,
  ナイアシン: 32,
  ビタミンB6: 1.2,
  ビタミンB12: 9,
  葉酸: 912,
  パントテン酸: 6,
  ビオチン: 111,
  ビタミンC: 84,
};

export const wannaEats: wannaEat[] = [
  { id: 1, name: '丼物', url: 'https://i.imgur.com/FzryyS8.png' },
  { id: 2, name: 'ドリア', url: 'https://i.imgur.com/ZzTo4tE.png' },
  { id: 3, name: 'ハンバーグ', url: 'https://i.imgur.com/gKBL6ZT.png' },
];

export const ideals: ideal[] = [
  { id: 1, name: '力士', url: 'https://i.imgur.com/Vioy5WK.png' },
  { id: 2, name: 'ガチムチ', url: 'https://i.imgur.com/fbRYP6E.png' },
  { id: 3, name: '普通', url: 'https://i.imgur.com/4BatJ2M.png' },
  { id: 4, name: 'モデル', url: 'https://i.imgur.com/Zx1F9qD.png' },
];
// ポークカレー
export const pokucaree: food = {
  カロリー: 764,
  タンパク質: 14.1,
  脂質: 28.9,
  炭水化物: 114.9,
  糖質: 105.5,
  食物繊維: 9.4,

  // ミネラル
  ナトリウム: 844,
  食塩相当量: 2.1,
  カリウム: 738,
  カルシウム: 63,
  マグネシウム: 54,
  リン: 251,
  鉄: 2.4,
  亜鉛: 2.9,
  銅: 0.42,
  マンガン: 1.46,
  ヨウ素: 2,
  セレン: 13,
  クロム: 2,
  モリブデン: 82,

  // ビタミン
  ビタミンA: 342,
  betaカロテン: 2633,
  ビタミンD: 0.3,
  ビタミンE: 1.0,
  ビタミンK: 19,
  ビタミンB1: 0.43,
  ビタミンB2: 0.22,
  ナイアシン: 9.0,
  ビタミンB6: 0.52,
  ビタミンB12: 0.4,
  葉酸: 47,
  パントテン酸: 1.97,
  ビオチン: 7.4,
  ビタミンC: 15,
};

//オムライス
export const omuraisu: food = {
  カロリー: 785,
  タンパク質: 29.5,
  脂質: 43.2,
  炭水化物: 67.8,
  糖質: 63.9,
  食物繊維: 3.9,

  // ミネラル
  ナトリウム: 1513,
  食塩相当量: 3.8,
  カリウム: 630,
  カルシウム: 93,
  マグネシウム: 48,
  リン: 431,
  鉄: 3.1,
  亜鉛: 3.6,
  銅: 0.37,
  マンガン: 0.67,
  ヨウ素: 31,
  セレン: 49,
  クロム: 2,
  モリブデン: 52,

  // ビタミン
  ビタミンA: 331,
  betaカロテン: 213,
  ビタミンD: 4.1,
  ビタミンE: 4.9,
  ビタミンK: 67,
  ビタミンB1: 0.21,
  ビタミンB2: 0.68,
  ナイアシン: 12.0,
  ビタミンB6: 0.35,
  ビタミンB12: 1.7,
  葉酸: 97,
  パントテン酸: 3.04,
  ビオチン: 41.6,
  ビタミンC: 5,
};

//醤油ラーメン
export const syouyuranmen: food = {
  カロリー: 434,
  タンパク質: 20.4,
  脂質: 8.8,
  炭水化物: 70.5,
  糖質: 63.7,
  食物繊維: 7.1,

  // ミネラル
  ナトリウム: 1990,
  食塩相当量: 5.2,
  カリウム: 572,
  カルシウム: 83,
  マグネシウム: 52,
  リン: 307,
  鉄: 1.7,
  亜鉛: 1.2,
  銅: 0.15,
  マンガン: 0.67,
  ヨウ素: 6,
  セレン: 51,
  クロム: 1,
  モリブデン: 22,

  // ビタミン
  ビタミンA: 54,
  betaカロテン: 133,
  ビタミンD: 0.8,
  ビタミンE: 0.7,
  ビタミンK: 12,
  ビタミンB1: 0.63,
  ビタミンB2: 0.27,
  ナイアシン: 10.9,
  ビタミンB6: 0.24,
  ビタミンB12: 0.5,
  葉酸: 40,
  パントテン酸: 1.82,
  ビオチン: 10.4,
  ビタミンC: 7,
};

//シーザーサラダ
export const sizasalad: food = {
  カロリー: 236,
  タンパク質: 7.6,
  脂質: 20.0,
  炭水化物: 5.3,
  糖質: 3.9,
  食物繊維: 1.2,

  // ミネラル
  ナトリウム: 547,
  食塩相当量: 1.5,
  カリウム: 237,
  カルシウム: 115,
  マグネシウム: 19,
  リン: 134,
  鉄: 1.1,
  亜鉛: 1.1,
  銅: 0.07,
  マンガン: 0.11,
  ヨウ素: 8,
  セレン: 13,
  クロム: 1,
  モリブデン: 5,

  // ビタミン
  ビタミンA: 100,
  betaカロテン: 539,
  ビタミンD: 0.7,
  ビタミンE: 2.7,
  ビタミンK: 72,
  ビタミンB1: 0.1,
  ビタミンB2: 0.19,
  ナイアシン: 2.7,
  ビタミンB6: 0.1,
  ビタミンB12: 0.8,
  葉酸: 76,
  パントテン酸: 0.56,
  ビオチン: 9.3,
  ビタミンC: 7,
};

//きんぴらごぼう
export const kinpiragobou: food = {
  カロリー: 95,
  タンパク質: 1.4,
  脂質: 3.0,
  炭水化物: 16.4,
  糖質: 11.0,
  食物繊維: 3.7,

  // ミネラル
  ナトリウム: 630,
  食塩相当量: 1.6,
  カリウム: 262,
  カルシウム: 34,
  マグネシウム: 41,
  リン: 58,
  鉄: 0.6,
  亜鉛: 0.6,
  銅: 0.14,
  マンガン: 0.23,
  ヨウ素: 1,
  セレン: 2,
  クロム: 1,
  モリブデン: 6,

  // ビタミン
  ビタミンA: 69,
  betaカロテン: 671,
  ビタミンD: 0.0,
  ビタミンE: 0.4,
  ビタミンK: 2,
  ビタミンB1: 0.04,
  ビタミンB2: 0.05,
  ナイアシン: 0.6,
  ビタミンB6: 0.09,
  ビタミンB12: 0.0,
  葉酸: 47,
  パントテン酸: 0.22,
  ビオチン: 2.4,
  ビタミンC: 2,
};

export const todayFood: foodDetail[] = [
  {
    name: 'きんぴらごぼう',
    class: '副菜',
    main: null,
    url: 'https://i.imgur.com/n5fIcTI.jpg',
    nutrition: kinpiragobou,
  },
  {
    name: 'ポークカレー',
    class: 'メイン',
    main: 'ご飯',
    url: 'https://i.imgur.com/iB6gm9H.jpg',
    nutrition: pokucaree,
  },
  {
    name: 'シーザーサラダ',
    class: '副菜',
    main: null,
    url: 'https://i.imgur.com/H6olvje.jpg',
    nutrition: sizasalad,
  },
];

export const suggestFoods: foodDetail[][] = [todayFood, todayFood, todayFood];
